#include <stdio.h>
#include <math.h>

int main() {
    int b, c;
    double a;

    printf("Введіть значення b (1,2,3): ");
    scanf("%d", &b);

    if (b != 1 && b != 2 && b != 3) {
        printf("Неправильне значення b. Потрібно ввести 1, 2 або 3.\n");
        return 1; // Повертаємо 1, щоб показати, що програма закінчилася з помилкою.
    }

    printf("Введіть значення c: ");
    scanf("%d", &c);

    if (c < 1 || c > 3) {
        printf("Неправильне значення c. Потрібно ввести значення від 1 до 3\n");
        return 1; // Повертаємо 1, щоб показати, що програма закінчилася з помилкою.
    }

    a = (b == 1) ? ((4 * b - 9 * c) / (pow(b, 2) - pow(c, 2))) :
        (b == 2) ? (sqrt(2 - b * c) / (b / pow(c, 2))) :
        (b == 3) ? (b / pow(c, 2)) : 0; // 0 - це значення за замовчуванням, яке нічого не робить.

    printf("a = %.2f\n", a);

    return 0;
}
