#include <stdio.h>
/* підключення бібліотеки, 
stdio.h функції введення-виведення, а також типи та макроси 
  */
#include <math.h>
//математичні функції та макроси

int main() {
  double r, h, S, V;
  //Створення функції main, яка виконує дії змінних double це створиння зміних
  
  printf("Введіть радіус: ");
  //введеня тексту
  scanf("%lf", &r);
  //lf це число з плаваючою точкою, введенях в зміну R
  printf("Введіть висоту циліндра: ");
  scanf("%lf", &h);
  //-||-
  S = 2 * M_PI * r * h;
  V = M_PI * pow(r, 2) * h;
  // Обчислення площі бічної поверхні та об'єму циліндра

  
  printf("Площа бічної поверхні: %.2lf\n", S);
  //виведення змінної S
  printf("Об'єм: %.2lf\n", V);
  //виведення змінної V 

  return 0;
  //закінчення команди зі значенням 0 успешне закінчення
}
